'#--------------------FN_DYNVARS_165_01-------------------------#'
SET @start_global_value = @@global.sql_slave_skip_counter;
ERROR HY000: Variable 'sql_slave_skip_counter' can only be set, not read
SELECT @@global.sql_slave_skip_counter;
ERROR HY000: Variable 'sql_slave_skip_counter' can only be set, not read
'Info:This value is write only. Value can not be read'
'#--------------------FN_DYNVARS_165_02-------------------------#'
SET @@global.sql_slave_skip_counter = DEFAULT;
ERROR 42000: Variable 'sql_slave_skip_counter' doesn't have a default value
'#--------------------FN_DYNVARS_165_03-------------------------#'
SET @@global.sql_slave_skip_counter = 0;
SET @@global.sql_slave_skip_counter = 5;
SET @@global.sql_slave_skip_counter = 1024;
SET @@global.sql_slave_skip_counter = 2147483648;
SET @@global.sql_slave_skip_counter = 2147483648*2;
SET @@global.sql_slave_skip_counter = 2147483648*2-1;
SET @@global.sql_slave_skip_counter = 4294967295*4294967295;
'#--------------------FN_DYNVARS_165_03-------------------------#'
SET @@global.sql_slave_skip_counter = '5';
ERROR 42000: Incorrect argument type to variable 'sql_slave_skip_counter'
SET @@global.sql_slave_skip_counter = 5.5;
ERROR 42000: Incorrect argument type to variable 'sql_slave_skip_counter'
SET @@global.sql_slave_skip_counter = -.5;
ERROR 42000: Incorrect argument type to variable 'sql_slave_skip_counter'
SET @@global.sql_slave_skip_counter = -.0;
ERROR 42000: Incorrect argument type to variable 'sql_slave_skip_counter'
'#--------------------FN_DYNVARS_165_03-------------------------#'
SET @@global.sql_slave_skip_counter = 1024;
SELECT VARIABLE_VALUE 
FROM INFORMATION_SCHEMA.SESSION_VARIABLES 
WHERE VARIABLE_NAME='sql_slave_skip_counter';
VARIABLE_VALUE

'#--------------------FN_DYNVARS_165_03-------------------------#'
SET @@sql_slave_skip_counter = 10;
ERROR HY000: Variable 'sql_slave_skip_counter' is a GLOBAL variable and should be set with SET GLOBAL
SET @@session.sql_slave_skip_counter = 12;
ERROR HY000: Variable 'sql_slave_skip_counter' is a GLOBAL variable and should be set with SET GLOBAL
SET @@local.sql_slave_skip_counter = 13;
ERROR HY000: Variable 'sql_slave_skip_counter' is a GLOBAL variable and should be set with SET GLOBAL
