SET @session_start_value = @@session.sql_log_off;
SELECT @session_start_value;
@session_start_value
0
'#--------------------FN_DYNVARS_157_01------------------------#'
SET @@session.sql_log_off = 0;
SET @@session.sql_log_off = DEFAULT;
SELECT @@session.sql_log_off;
@@session.sql_log_off
0
SET @@session.sql_log_off = 1;
SET @@session.sql_log_off = DEFAULT;
SELECT @@session.sql_log_off;
@@session.sql_log_off
1
'#---------------------FN_DYNVARS_157_02-------------------------#'
SET sql_log_off = 1;
SELECT @@sql_log_off;
@@sql_log_off
1
SELECT session.sql_log_off;
ERROR 42S02: Unknown table 'session' in field list
SELECT local.sql_log_off;
ERROR 42S02: Unknown table 'local' in field list
SET session sql_log_off = 0;
SELECT @@session.sql_log_off;
@@session.sql_log_off
0
'#--------------------FN_DYNVARS_157_03------------------------#'
SET @@session.sql_log_off = 0;
SELECT @@session.sql_log_off;
@@session.sql_log_off
0
SET @@session.sql_log_off = 1;
SELECT @@session.sql_log_off;
@@session.sql_log_off
1
'#--------------------FN_DYNVARS_157_04-------------------------#'
SET @@session.sql_log_off = -1;
ERROR 42000: Variable 'sql_log_off' can't be set to the value of '-1'
SET @@session.sql_log_off = 2;
ERROR 42000: Variable 'sql_log_off' can't be set to the value of '2'
SET @@session.sql_log_off = "T";
ERROR 42000: Variable 'sql_log_off' can't be set to the value of 'T'
SET @@session.sql_log_off = "Y";
ERROR 42000: Variable 'sql_log_off' can't be set to the value of 'Y'
SET @@session.sql_log_off = TRÜE;
ERROR 42000: Variable 'sql_log_off' can't be set to the value of 'TRÃœE'
SET @@session.sql_log_off = ÕN;
ERROR 42000: Variable 'sql_log_off' can't be set to the value of 'Ã•N'
SET @@session.sql_log_off = OF;
SELECT @@session.sql_log_off;
@@session.sql_log_off
0
'Bug# 34828: OF is taken as OFF and a value of 0 is set.'
SET @@session.sql_log_off = ÓFF;
ERROR 42000: Variable 'sql_log_off' can't be set to the value of 'Ã“FF'
SET @@session.sql_log_off = '¹';
ERROR 42000: Variable 'sql_log_off' can't be set to the value of '¹'
SET @@session.sql_log_off = NO;
ERROR 42000: Variable 'sql_log_off' can't be set to the value of 'NO'
'#-------------------FN_DYNVARS_157_05----------------------------#'
SET @@global.sql_log_off = 0;
ERROR HY000: Variable 'sql_log_off' is a SESSION variable and can't be used with SET GLOBAL
SELECT @@global.sql_log_off;
ERROR HY000: Variable 'sql_log_off' is a SESSION variable
'#----------------------FN_DYNVARS_157_06------------------------#'
SELECT count(VARIABLE_VALUE) 
FROM INFORMATION_SCHEMA.GLOBAL_VARIABLES 
WHERE VARIABLE_NAME='sql_log_off';
count(VARIABLE_VALUE)
1
'#----------------------FN_DYNVARS_157_07------------------------#'
SELECT @@session.sql_log_off = VARIABLE_VALUE 
FROM INFORMATION_SCHEMA.SESSION_VARIABLES 
WHERE VARIABLE_NAME='sql_log_off';
@@session.sql_log_off = VARIABLE_VALUE
1
SELECT @@session.sql_log_off;
@@session.sql_log_off
0
SELECT VARIABLE_VALUE
FROM INFORMATION_SCHEMA.SESSION_VARIABLES 
WHERE VARIABLE_NAME='sql_log_off';
VARIABLE_VALUE
OFF
'#---------------------FN_DYNVARS_157_08-------------------------#'
SET @@session.sql_log_off = OFF;
SELECT @@session.sql_log_off;
@@session.sql_log_off
0
SET @@session.sql_log_off = ON;
SELECT @@session.sql_log_off;
@@session.sql_log_off
1
'#---------------------FN_DYNVARS_157_09----------------------#'
SET @@session.sql_log_off = TRUE;
SELECT @@session.sql_log_off;
@@session.sql_log_off
1
SET @@session.sql_log_off = FALSE;
SELECT @@session.sql_log_off;
@@session.sql_log_off
0
SET @@session.sql_log_off = @session_start_value;
SELECT @@session.sql_log_off;
@@session.sql_log_off
0
