SET @session_start_value = @@session.sql_warnings;
SELECT @session_start_value;
@session_start_value
0
'#--------------------FN_DYNVARS_166_01------------------------#'
SET @@session.sql_warnings = 0;
SET @@session.sql_warnings = DEFAULT;
SELECT @@session.sql_warnings;
@@session.sql_warnings
0
SET @@session.sql_warnings = 1;
SET @@session.sql_warnings = DEFAULT;
SELECT @@session.sql_warnings;
@@session.sql_warnings
1
'#---------------------FN_DYNVARS_166_02-------------------------#'
SET sql_warnings = 1;
SELECT @@sql_warnings;
@@sql_warnings
1
SELECT session.sql_warnings;
ERROR 42S02: Unknown table 'session' in field list
SELECT local.sql_warnings;
ERROR 42S02: Unknown table 'local' in field list
SET session sql_warnings = 0;
SELECT @@session.sql_warnings;
@@session.sql_warnings
0
'#--------------------FN_DYNVARS_166_03------------------------#'
SET @@session.sql_warnings = 0;
SELECT @@session.sql_warnings;
@@session.sql_warnings
0
SET @@session.sql_warnings = 1;
SELECT @@session.sql_warnings;
@@session.sql_warnings
1
'#--------------------FN_DYNVARS_166_04-------------------------#'
SET @@session.sql_warnings = -0.6;
ERROR 42000: Variable 'sql_warnings' can't be set to the value of '-1'
SET @@session.sql_warnings = 1.9;
ERROR 42000: Variable 'sql_warnings' can't be set to the value of '2'
SET @@session.sql_warnings = "T";
ERROR 42000: Variable 'sql_warnings' can't be set to the value of 'T'
SET @@session.sql_warnings = "Y";
ERROR 42000: Variable 'sql_warnings' can't be set to the value of 'Y'
SET @@session.sql_warnings = TRÜE;
ERROR 42000: Variable 'sql_warnings' can't be set to the value of 'TRÃœE'
SET @@session.sql_warnings = ÕN;
ERROR 42000: Variable 'sql_warnings' can't be set to the value of 'Ã•N'
SET @@session.sql_warnings = OF;
SELECT @@session.sql_warnings;
@@session.sql_warnings
0
'Bug# 34828: OF is taken as OFF and a value of 0 is set.'
SET @@session.sql_warnings = ÓFF;
ERROR 42000: Variable 'sql_warnings' can't be set to the value of 'Ã“FF'
SET @@session.sql_warnings = '¹';
ERROR 42000: Variable 'sql_warnings' can't be set to the value of '¹'
SET @@session.sql_warnings = NO;
ERROR 42000: Variable 'sql_warnings' can't be set to the value of 'NO'
'#-------------------FN_DYNVARS_166_05----------------------------#'
SET @@global.sql_warnings = 0;
ERROR HY000: Variable 'sql_warnings' is a SESSION variable and can't be used with SET GLOBAL
SELECT @@global.sql_warnings;
ERROR HY000: Variable 'sql_warnings' is a SESSION variable
'#----------------------FN_DYNVARS_166_06------------------------#'
SELECT count(VARIABLE_VALUE)
FROM INFORMATION_SCHEMA.GLOBAL_VARIABLES 
WHERE VARIABLE_NAME='sql_warnings';
count(VARIABLE_VALUE)
1
'#----------------------FN_DYNVARS_166_07------------------------#'
SELECT @@session.sql_warnings = VARIABLE_VALUE 
FROM INFORMATION_SCHEMA.SESSION_VARIABLES 
WHERE VARIABLE_NAME='sql_warnings';
@@session.sql_warnings = VARIABLE_VALUE
1
SELECT @@session.sql_warnings;
@@session.sql_warnings
0
SELECT VARIABLE_VALUE
FROM INFORMATION_SCHEMA.SESSION_VARIABLES 
WHERE VARIABLE_NAME='sql_warnings';
VARIABLE_VALUE
OFF
'Bug: value in information schema does not match'
'#---------------------FN_DYNVARS_166_08-------------------------#'
SET @@session.sql_warnings = OFF;
SELECT @@session.sql_warnings;
@@session.sql_warnings
0
SET @@session.sql_warnings = ON;
SELECT @@session.sql_warnings;
@@session.sql_warnings
1
'#---------------------FN_DYNVARS_166_09----------------------#'
SET @@session.sql_warnings = TRUE;
SELECT @@session.sql_warnings;
@@session.sql_warnings
1
SET @@session.sql_warnings = FALSE;
SELECT @@session.sql_warnings;
@@session.sql_warnings
0
SET @@session.sql_warnings = @session_start_value;
SELECT @@session.sql_warnings;
@@session.sql_warnings
0
