SET @session_start_value = @@session.sql_notes;
SELECT @session_start_value;
@session_start_value
1
'#--------------------FN_DYNVARS_161_01------------------------#'
SET @@session.sql_notes = 0;
SET @@session.sql_notes = DEFAULT;
SELECT @@session.sql_notes;
@@session.sql_notes
0
SET @@session.sql_notes = 1;
SET @@session.sql_notes = DEFAULT;
SELECT @@session.sql_notes;
@@session.sql_notes
1
'#---------------------FN_DYNVARS_161_02-------------------------#'
SET sql_notes = 1;
SELECT @@sql_notes;
@@sql_notes
1
SELECT session.sql_notes;
ERROR 42S02: Unknown table 'session' in field list
SELECT local.sql_notes;
ERROR 42S02: Unknown table 'local' in field list
SET session sql_notes = 0;
SELECT @@session.sql_notes;
@@session.sql_notes
0
'#--------------------FN_DYNVARS_161_03------------------------#'
SET @@session.sql_notes = 0;
SELECT @@session.sql_notes;
@@session.sql_notes
0
SET @@session.sql_notes = 1;
SELECT @@session.sql_notes;
@@session.sql_notes
1
'#--------------------FN_DYNVARS_161_04-------------------------#'
SET @@session.sql_notes = -1;
ERROR 42000: Variable 'sql_notes' can't be set to the value of '-1'
SET @@session.sql_notes = 2;
ERROR 42000: Variable 'sql_notes' can't be set to the value of '2'
SET @@session.sql_notes = "T";
ERROR 42000: Variable 'sql_notes' can't be set to the value of 'T'
SET @@session.sql_notes = "Y";
ERROR 42000: Variable 'sql_notes' can't be set to the value of 'Y'
SET @@session.sql_notes = TRÜE;
ERROR 42000: Variable 'sql_notes' can't be set to the value of 'TRÃœE'
SET @@session.sql_notes = ÕN;
ERROR 42000: Variable 'sql_notes' can't be set to the value of 'Ã•N'
SET @@session.sql_notes = OF;
SELECT @@session.sql_notes;
@@session.sql_notes
0
'Bug# 34828: OF is taken as OFF and a value of 0 is set.'
SET @@session.sql_notes = ÓFF;
ERROR 42000: Variable 'sql_notes' can't be set to the value of 'Ã“FF'
SET @@session.sql_notes = '¹';
ERROR 42000: Variable 'sql_notes' can't be set to the value of '¹'
SET @@session.sql_notes = NO;
ERROR 42000: Variable 'sql_notes' can't be set to the value of 'NO'
'#-------------------FN_DYNVARS_161_05----------------------------#'
SET @@global.sql_notes = 0;
ERROR HY000: Variable 'sql_notes' is a SESSION variable and can't be used with SET GLOBAL
SELECT @@global.sql_notes;
ERROR HY000: Variable 'sql_notes' is a SESSION variable
'#----------------------FN_DYNVARS_161_06------------------------#'
SELECT count(VARIABLE_VALUE) FROM INFORMATION_SCHEMA.GLOBAL_VARIABLES WHERE VARIABLE_NAME='sql_notes';
count(VARIABLE_VALUE)
1
'#----------------------FN_DYNVARS_161_07------------------------#'
SELECT @@session.sql_notes = VARIABLE_VALUE 
FROM INFORMATION_SCHEMA.SESSION_VARIABLES 
WHERE VARIABLE_NAME='sql_notes';
@@session.sql_notes = VARIABLE_VALUE
1
SELECT @@session.sql_notes;
@@session.sql_notes
0
SELECT VARIABLE_VALUE 
FROM INFORMATION_SCHEMA.SESSION_VARIABLES 
WHERE VARIABLE_NAME='sql_notes';
VARIABLE_VALUE
OFF
'#---------------------FN_DYNVARS_161_08-------------------------#'
SET @@session.sql_notes = OFF;
SELECT @@session.sql_notes;
@@session.sql_notes
0
SET @@session.sql_notes = ON;
SELECT @@session.sql_notes;
@@session.sql_notes
1
'#---------------------FN_DYNVARS_161_09----------------------#'
SET @@session.sql_notes = TRUE;
SELECT @@session.sql_notes;
@@session.sql_notes
1
SET @@session.sql_notes = FALSE;
SELECT @@session.sql_notes;
@@session.sql_notes
0
SET @@session.sql_notes = @session_start_value;
SELECT @@session.sql_notes;
@@session.sql_notes
1
