Repository: pieter/mysql-server
Catalog: debian/po/*.po
Languages: da, gl, ja, nb, nl, pt, pt_br, ro, sv

source: Do you really want to downgrade?
da: Ønsker du virkelig at nedgradere?
gl: ¿Quere pasar a unha versión anterior?
ja: 本当にダウングレードしますか?
nb: Er du sikker på at du vil nedgradere?
nl: Wilt u echt een oude versie herstellen?
pt: Deseja mesmo fazer downgrade?
pt_br: Você realmente quer atualizar?
ro: Sunteţi sigur că doriţi să instalaţi o versiune mai veche?
sv: Vill du verkligen nedgradera?

source: WARNING: The file /var/lib/mysql/debian-*.flag exists. This indicates that a mysql-server package with a higher version has been installed before. It can not be guaranteed that this version can use its data.
da: Advarsel: Filen /var/lib/mysql/debian-*.flag eksisterer. Det tyder på at der tidligere har været installeret en højere version af mysql-server-pakken. Det kan ikke garanteres at denne version kan benytte data fra den højere version.
gl: AVISO: O ficheiro /var/lib/mysql/debian-*.flag existe. Isto indica que se instalou antes un paquete mysql-server dunha versión maior. Non se pode garantir que esta versión poida empregar os seus datos.
ja: 警告: /var/lib/mysql/debian-*.flag ファイルが存在しています。これは、以前により新しいバージョンの mysql-server パッケージがインストールされていたことを示します。データをこのバージョンで使えるかどうか、保証できません。
nb: ADVARSEL: Fila /var/lib/mysql/debian-*.flag finnes. Dette viser at en mysql-server-pakke med et høyere versjonsnummer har vært installert før. Det kan ikke garanteres at denne versjonen kan bruke data fra den høyere versjonen.
nl: Waarschuwing: waarschijnlijk is een hogere versie van het mysql-server pakket geïnstalleerd geweest (het bestand /var/lib/mysql/debian-*.flag bestaat). Er is geen garantie dat de gegevensbestanden, bewerkt met die hogere versie, kunnen worden gebruikt met de versie van mysql die u nu installeert.
pt: AVISO: o ficheiro /var/lib/mysql/debian-*.flag existe. Isto significa que antes foi instalado um pacote mysql-server com número de versão superior. Não pode ser garantido que esta versão utilize esses dados.
pt_br: AVISO: O arquivo /var/lib/mysql/debian-*.flag existe. Isso indica que um pacote mysql-server com uma versão maior foi instalado antes. Não há como garantir que esta versão poderá usar seus dados.
ro: AVERTISMENT: Fişierul /var/lib/mysql/debian-*.flag există. Acest lucru indică faptul că anterior a fost instalată o versiune nouă a pachetului mysql-server. Nu se poate garanta că versiunea instalată acum poate folosi datele versiunii instalate anterior.
sv: VARNING: Filen /var/lib/mysql/debian-*.flag existerar. Detta betyder att paketet mysql-server med högre versionsnummer har installerats tidigare. Det kan inte garanteras att denna version kan använda dess data.

source: Important note for NIS/YP users!
da: Vigtig bemærkning for NIS/YP-brugere!
gl: Nota importante para usuarios de NIS/YP
ja: NIS/YP ユーザへ重要な注意!
nb: Viktig merknad for NIS/YP-brukere!
nl: Belangrijke opmerking voor gebruikers van NIS/YP!
pt: Nota importante para utilizadores de NIS/YP!
pt_br: Aviso importante para usuários NIS/YP!
ro: Notă importantă pentru utilizatorii NIS/YP!
sv: Viktig notering för NIS/YP-användare!

source: To use mysql you must install an equivalent user and group to the following and ensure yourself that /var/lib/mysql has the right permissions (the uid/gid may be different).
da: For at kunne bruge mysql skal du installere en bruger og en gruppe, der svarer til nedenstående, og sikre dig at /var/lib/mysql har de rigtige adgangsrettigheder (uid/gid kan afvige).
gl: Para empregar mysql debe instalar un usuario e grupo equivalentes aos seguintes e asegurarse de que /var/lib/mysql teña os permisos correctos (o uid/gid poden ser diferentes).
ja: mysql を利用するには 以下のユーザとグループを作成し、/var/lib/mysql が正しい権限になっているかどうかを確認する必要があります (おそらく uid/gid が違います)。
nb: For å bruke MySQL må du installere en bruker og gruppe tilsvarende den nedenfor og se til at /var/lib/mysql har riktige rettigheter (uid/gid kan være forskjellig).
nl: Om mysql te gebruiken dient u een gebruiker en groep aan te maken, gelijkwaardig aan onderstaand voorbeeld, en u dient ervoor te zorgen dat /var/lib/mysql de bijbehorende toegangsrechten heeft (uid en gid mogen anders zijn).
pt: Para utilizar mysql e instalar um utilizador e grupo equivalentes para o seguinte e assegurar-se que /var/lib/mysql têm as permissões correctas (o uid/gid podem ser diferentes).
pt_br: Para utilizar o MySQL, você deve instalar um usuário e um grupo equivalentes ao usuário e grupo a seguir para se certificar de que o diretório /var/lib/mysql possua as permissões correctas (o uid/gid podem ser diferentes).
ro: Pentru a folosi mysql trebuie să adăugaţi un utilizator şi grup echivalent şi să vă asiguraţi că /var/lib/mysql are permisiunile stabilite corect (uid/gid pot aveavalori diferite).
sv: För att använda MySQL måste du installera en motsvarande användare och grupp till följande och se till att /var/lib/mysql har korrekta rättigheter satta (uid/gid kan vara olika).

source: /etc/passwd: mysql:x:100:101:MySQL Server:/var/lib/mysql:/bin/false
gl: /etc/passwd: mysql:x:100:101:Servidor MySQL:/var/lib/mysql:/bin/false

source: Remove the databases used by all MySQL versions?
da: Fjern de databaser, der benyttes af samtlige MySQL-versioner?
gl: ¿Eliminar as bases de datos empregadas por tódalas versións de MySQL?
ja: 全バージョンの MySQL で利用されているデータベースを削除しますか?
nb: Skal databasene brukt av alle MySQL-versjoner fjernes?
nl: Databases verwijderen die door alle MySQL versies worden gebruikt?
pt: Remover as bases de dados utilizadas por todas as versões de MySQL?
pt_br: Remover as bases de dados utilizadas por todas as versões do MySQL?
ro: Doriţi să ştergeţi bazele de date folosite de toate versiune MySQL?
sv: Ta bort databaserna som används av alla MySQL-versioner?

source: The script is about to remove the data directory /var/lib/mysql. If it is planned to just install a higher MySQL version or if a different mysql-server package is already using it, the data should be kept.
da: Scriptet skal til at fjerne datamappen /var/lib/mysql. Hvis du regner medblot at installere en højere MySQL-version, eller hvis der allerede kører en anden MySQL-serverpakke, bør dataene bevares.
gl: O script vai eliminar o directorio de datos /var/lib/mysql. Se se planea instalar unha versión superior de MySQL ou se hai outro paquete mysql-server que o estean a empregar, debería conservar os datos.
ja: このスクリプトはデータのディレクトリ /var/lib/mysql を削除するためのものです。単に新しいバージョンの MySQL をインストールしようとしている、あるいは別の mysql-server パッケージを既に使っている場合、データは保持する必要があります。
nb: Dette skriptet skal til å fjerne data-mappa /var/lib/mysql. Denne mappa bør beholdes hvis det bare skal installeres en høyere MySQL-versjon, eller hvis en annen mysql-server-pakke allerede bruker den.
nl: Het script staat op het punt de datamap /var/lib/mysql te verwijderen. Als het plan alleen maar is om een hogere MySQL versie te installeren, of als een ander mysql-serverpakket de datamap al gebruikt, dan zou de data moeten worden behouden.
pt: O script está prestes a remover o directório de dados /var/lib/mysql. Se o planeado é apenas instalar uma versão superior do MySQL ou se um pacote mysql-server diferente já os estão a utilizar, os dados devem ser mantidos.
pt_br: O script está prestes a remover o diretório de dados /var/lib/mysql. Caso seja planejado somente instalar uma versão mais nova do MySQL ou caso um pacote mysql-server diferente já os esteja usando, os dados devem ser mantidos.
ro: Scriptul urmează să şteargă directorul de date /var/lib/mysql. Dacă plănuiţi doar să instalaţi o versiune nouă MySQL sau datele sunt folosite de către un alt pachet mysql-server, atunci ar trebui păstraţi datele.
sv: Scriptet kommer strax ta bort data-katalogen /var/lib/mysql. Om det planerade var att bara installera en högre MySQL-version eller om ett annan mysql-server paket redan använde det, skall datan sparas.

source: Should MySQL start on boot?
da: Skal MySQL startes under systemopstart?
gl: ¿MySQL debería iniciarse co ordenador?
ja: MySQL をシステム起動時に開始しますか?
nb: Skal MySQL startes ved maskinoppstart?
nl: Moet MySQL starten als de computer start?
pt: O MySQL deve iniciar no arranque?
pt_br: O MySQL deve ser iniciado na inicialização da máquina?
ro: Doriţi ca MySQL să pornească la initializarea sistemului?
sv: Ska MySQL startas när systemet startar upp?

source: The MySQL can start automatically on boot time or only if you manually type '/etc/init.d/mysql start'.
da: MySQL kan enten startes op under systemopstarten eller kun hvis du manuelt skriver '/etc/init.d/mysql start'.
gl: MySQL pode arrincar automaticamente ao iniciar o ordenador ou só se escribe "/etc/init.d/mysql start" a man.
ja: MySQL の起動方法について、システム起動時に自動的に開始するか、あるいは '/etc/init.d/mysql start' と手で入力した時のみ起動するかを選べます。
nb: MySQL kan startes automatisk når maskinen starter, eller bare hvis du skriver «/etc/init.d/mysql start».
nl: MySQL kan automatisch starten bij het starten van de computer, of slechts wanneer u '/etc/init.d/mysql start' handmatig uitvoert.
pt: O MySQL pode iniciar automaticamente no arranque ou apenas se digitar '/etc/init.d/mysql start'.
pt_br: O MySQL pode ser iniciado automaticamente na inicialização da máquina ou apenas caso você use o comando '/etc/init.d/mysql start' manualmente.
ro: MySQL poate porni automat la iniţializarea sistemului sau doar dacă rulaţi comanda „/etc/init.d/mysql start”.
sv: MySQL kan startas när systemet startas upp eller endast om du manuellt skriver '/etc/init.d/mysql start'.

source: New password for MySQL "root" user:
da: Ny adgangskode for MySQL's "root"-bruger:
gl: Novo contrasinal para o usuario "root" de MySQL
ja: MySQL の "root" ユーザに対する新しいパスワード:
nb: Nytt passord for MySQLs «root»-bruker:
nl: Nieuw wachtwoord voor de MySQL "root"-gebruiker:
pt: Nova password para o utilizador "root" do MySQL:
pt_br: Nova senha para o usuário "root" do MySQL:
ro: Noua parolă pentru utilizatorul „root” al MySQL:
sv: Nytt lösenord för MySQLs "root"-användare:

source: It is highly recommended that you set a password for the MySQL administrative "root" user.
da: Det anbefales kraftigt, at du sætter en adgangskode for MySQL's administrationsbruger "root".
gl: Recoméndase encarecidamente que estabreza un contrasinal para o usuario administrativo "root" de MySQL.
ja: MySQL を管理する "root" ユーザのパスワードを設定することを強くお勧めします。
nb: Det anbefales sterkt at du oppgir et passord for den administrative «root»-brukeren i MySQl.
nl: Het wordt sterk aangeraden een wachtwoord in te stellen voor de administratieve MySQL "root"-gebruiker.
pt: É fortemente recomendado que defina uma password para o utilizador administrativo "root" do MySQL.
pt_br: É altamente recomendado que você defina uma senha para o usuário administrativo "root" do MySQL.
ro: Este recomandat să stabiliţi o parolă pentru utilizatorul administrativ „root” al MySQL.
sv: Det är starkt rekommenderat att du sätter ett lösenord för MySQLs administrativa "root"-användare.

source: If you do not provide a password no changes will be made to the account.
da: Hvis du ikke angiver en adgangskode, vil kontoen ikke blive ændret.
gl: Se non fornece un contrasinal non se ha facer ningún cambio na conta.
ja: パスワードを入力しない場合、アカウントに対して変更は加えられません。
nb: Hvis du ikke oppgir et passord blir det ikke gjort noen endringer med kontoen.
nl: Indien u geen wachtwoord opgeeft zal het account niet worden gewijzigd.
pt: Se não disponibilizar uma password não serão feitas alterações nesta conta.
pt_br: Caso você não forneça uma senha, nenhuma mudança será feita na conta.
ro: Dacă nu introduceţi nici o parolă, nici o schimbare nu va fi luată în considerare.
sv: Om du inte anger ett lösenord kommer inga ändringar att göras för kontot.

source: Unable to set password for MySQL "root" user
da: Kunne ikke sætte adgangskoden for MySQL's "root"-bruger
gl: Non se puido establecer o contrasinal para o usuario "root" de MySQL
ja: MySQL の "root" ユーザのパスワードを設定できません
nb: Klarer ikke angi passord for MySQLs «root»-bruker
nl: Kan het wachtwoord voor de MySQL "root"-gebruiker niet instellen
pt: Não foi possível definir a password para o utilizador "root" do MySQL
pt_br: Impossível definir senha para o usuário "root" do MySQL
ro: Nu s-a putut stabili parola pentru utilizatorul „root” al MySQL
sv: Lyckades inte sätta lösenord för MySQLs "root"-användare

source: It seems an error occurred while setting the password for the MySQL administrative user. This may have happened because the user already has a password, or because there was a problem communicating with the MySQL server.
da: Det lader til, at der opstod en fejl, da adgangskoden for MySQL's administrationsbruger skulle ændres. Dette kan være sket, fordi brugeren allerede har en adgangskode, eller fordi der var problemer med at kommunikere med MySQL-serveren.
gl: Semella que houbo un erro ao establecer o contrasinal para o usuario administrativo de MySQL. Puido ocorrer porque o usuario xa teña un contrasinal ou porque teña habido un problema ao se comunicar co servidor MySQL.
ja: MySQL の管理者ユーザに対してパスワードを設定しようとした際、エラーが発生したようです。これは既に管理者ユーザにパスワードが設定されていたか、MySQL サーバとの接続に問題があったためだと思われます。
nb: Det ser ut til at det oppsto en feil mens det ble satt et passord for MySQLs administrative bruker. Dette kan være fordi brukeren allerede har et passord, eller fordi det var et kommunikasjonsproblem med MySQL-tjeneren.
nl: Er lijkt een fout te zijn opgetreden bij het instellen van het wachtwoord van de MySQL administratieve gebruiker. Dat kan komen doordat de gebruiker al een wachtwoord heeft, of omdat er een probleem was bij het communiceren met de MySQL server.
pt: Parece que ocorreu um erro enquanto era definida a password para o utilizador administrativo do MySQL. Isto pode ter acontecido porque o utilizador já tem uma password, ou porque ocorreu um problema ao comunicar com o servidor MySQL.
pt_br: Parece que um erro cocrreu durante a definição da senha para o usuário administrativo do MySQL. Isso pode ter acontecido devido ao usuário já possuir uma senha definida ou devido a ocorrência de um problema de comunicação com o servidor MySQL.
ro: Se pare că a intervenit o eroare în stabilirea parolei pentru utilizatorul administrativ al MySQL. Acest lucru se poate întâmpla dacă utilizatorul are deja o parolă, sau a existat o problemă în comunicarea cu serverul MySQL.
sv: Det verkar som ett fel uppstod när det skulle sättas ett lösenord för MySQLs administrativa användare. Detta kan ha skett för att användaren redan har ett lösenord satt, eller på grund av problem med att kommunicera med MySQL-servern.

source: When installation finishes, you should verify that the account is properly protected with a password (see README.Debian for more information).
da: Når installationen afsluttes, bør du tjekke at kontoen er ordentligt beskyttet med en adgangskode (se README.Debian for yderligere oplysninger).
gl: Ao rematar a instalación debería comprobar que a conta estea correctamente protexida cun contrsinal (consulte o ficheiro README.Debian para ter máis información).
ja: インストールが終了した際、アカウントがパスワードできちんと保護されているかどうかを確認してください (詳細については README.Debian を参照してください)。
nb: Når installasjonen er ferdig bør det sjekkes at kontoen er ordentlig beskyttet med et passord (mer informasjon finnes i README.Debian).
nl: Wanneer de installatie klaar is, dient u te verifiëren dat het account netjes beschermd is met een wachtwoord (zie README.Debian voor meer informatie).
pt: Quando terminar a instalação, deve verificar se a conta está devidamente protegida com uma password (para mais informações veja README.Debian).
pt_br: Quando a instalação finalizar, você deverá verificar se a conta está apropriadamente protegida com uma senha (consulte o arquivo README.Debian para maiores informações).
ro: După finalizarea instalării, ar trebui să verificaţi dacă contul este protejat cu o parolă (citiţi fişierul README.Debian pentru informaţii suplimentare).
sv: När installationen är klar, bör du kontrollera så att kontot är riktigt skyddat av ett lösenord (läs README.Debian för mer information).

source: Support MySQL connections from hosts running Debian "sarge" or older?
da: Understøt MySQL-forbindelser fra maskiner, der kører Debian "Sarge" eller ældre?
gl: ¿Soportar as conexións a MySQL de máquinas que empreguen Debian "sarge" ou anterior?
ja: Debian "Sarge" あるいはそれよりも古いバージョンが稼働しているホストからの MySQL 接続をサポートしますか?
nb: Skal MySQL-tilkoblinger støttes fra vertsmaskiner som kjører Debian «sarge» eller eldre?
nl: Moet u MySQL-verbindingen accepteren van computers die Debian "sarge" of ouder draaien?
pt: Suportar ligações MySQL de máquinas que corram Debian "sarge" ou mais antigos?
pt_br: Suportar conexões MySQL originadas de hosts executando o Debian "sarge" ou mais antigos ?
ro: Suportaţi conexiuni MySQL de la staţii ce rulează sistemul Debian „sarge” sau mai vechi?
sv: Behöver du MySQL-anslutningar från system som kör Debian "Sarge" eller äldre?

source: The way passwords were stored was not very secure. This has been improved with the drawback that clients (e.g. PHP) from hosts running Debian 3.1 Sarge will not be able to connect to account which are new or whose password have been changed. See /usr/share/doc/mysql-server-5.0/README.Debian.
da: Den måde, adgangskoder blev gemt på tidligere, var ikke ret sikker. Dette er blevet forbedret med den bivirkning, at klienter (f.eks. PHP) fra maskiner, der kører Debian 3.1 Sarge ikke vil kunne forbindes til en konto, der er ny, eller hvis adgangskode er blevet ændret. Se /usr/share/doc/mysql-server-5.0/README.Debian.
gl: O xeito no que se armacenaban os contrasinais non era moi seguro. Isto mellorouse co inconveniente de que os clientes (por exemplo, PHP) das máquinas que executen Debian 3.1 Sarge non se han poder conectar a contas novas ou nas que se cambiara o contrasinal. Consulte /usr/share/doc/mysql-server-5.0/README.Debian.
ja: パスワードの保存方法は、あまり安全な方法で行われていませんでした。これは改善されましたが、Debian 3.1 Sarge が稼働しているホストからクライアント (PHP など) が新しいアカウントやパスワードが変更されたアカウントには接続できなくなるという欠点もでています。詳細については /usr/share/doc/mysql-server-5.0/README.Debian を参照してください。
nb: Passord ble tidligere lagret på en lite sikker måte. Dette er nå forbedret, med den ulempen at klienter (f.eks. PHP) fra verter som kjører Debian 3.1 Sarge ikke vil kunne koble til en konto som er ny eller har fått endret passordet. Se /usr/share/doc/mysql-server-5.0/README.Debian.
nl: De wijze waarop wachtwoorden werden bewaard was niet erg veilig. Dit is verbeterd, maar helaas zullen programma's van computers die Debian 3.1 Sarge draaien, geen verbinding meer kunnen maken met accounts die nieuw zijn, of waarvan het wachtwoord is gewijzigd. Zie /usr/share/doc/mysql-server-5.0/README.Debian.
pt: O modo como as passwords eram guardadas não era muito seguro. Isto foi melhorado com o senão que clientes (e.g. PHP) e máquinas que corram Debian 3.1 Sarge não irão conseguir ligar às contas que sejam novas ou cuja password foi alterada. Veja /usr/share/doc/mysql-server-5.0/README.Debian.
pt_br: A maneira com que as senhas eram armazenadas não era muito segura. Isso foi melhorado, mas com o incômodo de que clientes (por exemplo, o PHP) em hosts executando o Debian 3.1 (Sarge) não serão capazes de conectar em contas novas ou para as quais as senhas tenham sido modificadas. Consulte /usr/share/doc/mysql-server-5.0/README.Debian.
ro: Modul în care erau păstrate parolele nu era foarte sigur. Acest lucru a fost îmbunătăţitcu dezajantajul că clienţii (de ex. PHP) de pe staţii ce rulează sistemul Debian 3.1 Sargenu se vor putea conecta la conturi noi sau ale căror parole au fost schimbate. Citiţi /usr/share/doc/mysql-server-5.0/README.Debian.
sv: Sättet som lösenorden lagrades på var inte särskilt säkert. Detta har förbättrats på bekostnad av att klienter (t.ex. PHP) från system som kör Debian 3.1 Sarge inte kan ansluta till konton som är nya eller vars lösenord har ändrats. Se /usr/share/doc/mysql-server-5.0/README.Debian.
